lvx/base/DataProcessors/бит_ЗакрытиеДокументовПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗакрытиеДокументовПланирования</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСообщений</Name>
					<Comment>Режим сообщений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Comment>Причина закрытия</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныЗакрытияДокументовПланированияПлатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРегламентнаяОперация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьДокументов</Name>
					<Comment>Перечень документов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Закрыть</Name>
							<Comment>Закрыть</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>Организация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПланирования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_СводнаяЗаявкаНаЗатраты</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ОтражениеФактаЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПозицияПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_СводнаяЗаявкаНаЗатраты</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ОтражениеФактаЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Comment>ЦФО</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Comment>Сумма документа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстаток</Name>
							<Comment>Сумма остаток</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Comment>Валюта документа</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗакрытия</Name>
							<Comment>Причина закрытия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныЗакрытияДокументовПланированияПлатежа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПозиции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/Enums/бит_ТипыСохраненныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСохраненныхНастроек</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиПанелиИндикаторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/DataProcessors/бит_ЗакрытиеДокументовПланирования/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПричинаЗакрытияПриИзменении(Элемент)
	
	ПричинаУказаннаПравильно(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыНастроекПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаНастройкиКомпоновщика И ИзмененыВыбранныеТипы Тогда
		Если ТипыДокументовЗаполненыПравильно() Тогда
			ОбработатьИзменениеВыбранныхТипов();
		Иначе	
			ТекущаяСтраница = Элементы.СтраницаТипыДокументов;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВариантПриИзменении(Элемент)
	
	Объект.Период = Новый СтандартныйПериод(НастройкаПериода.Вариант);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПереченьдокументов

&НаКлиенте
Процедура ПереченьДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПереченьДокументов.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.ПереченьДокументовДокументПланирования Тогда
		
		ИмяФормыОбъекта		 = "";
		
		Если ТипЗнч(ТекущиеДанные.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
			ИмяФормыОбъекта = "Документ.бит_кзн_ЗаявкаНаРасходованиеСредств.ФормаОбъекта"; 
		ИначеЕсли ТипЗнч(ТекущиеДанные.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию") Тогда
			ИмяФормыОбъекта = "Документ.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.ФормаОбъекта"; 
		ИначеЕсли ТипЗнч(ТекущиеДанные.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств") Тогда
			ИмяФормыОбъекта = "Документ.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.ФормаОбъекта";
		ИначеЕсли ТипЗнч(ТекущиеДанные.ДокументПланирования) = Тип("ДокументСсылка.бит_пз_ЗаявкаНаЗатраты") Тогда
			ИмяФормыОбъекта = "Документ.бит_пз_ЗаявкаНаЗатраты.ФормаОбъекта";
		ИначеЕсли ТипЗнч(ТекущиеДанные.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
			ИмяФормыОбъекта = "Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ФормаОбъекта";
		ИначеЕсли ТипЗнч(ТекущиеДанные.ДокументПланирования) = Тип("ДокументСсылка.бит_пз_СводнаяЗаявкаНаЗатраты") Тогда
			ИмяФормыОбъекта = "Документ.ВТ_СводныеЗаявкиНаЗатраты.ФормаОбъекта";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяФормыОбъекта) Тогда
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.ДокументПланирования);
			ОткрытьФорму(ИмяФормыОбъекта, ПараметрыФормы, ЭтотОбъект, ТекущиеДанные.ДокументПланирования);
		КонецЕсли;
	
	ИначеЕсли Поле = Элементы.ПереченьДокументовПозиция Тогда
		
		СтандартнаяОбработка = Ложь;
		ИмяФормыОбъекта		 = "";
		
		Если ТипЗнч(ТекущиеДанные.Позиция) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
			ИмяФормыОбъекта = "Документ.бит_кзн_ПлатежнаяПозиция.ФормаОбъекта";
		ИначеЕсли ТипЗнч(ТекущиеДанные.Позиция) = Тип("ДокументСсылка.бит_кзн_ПозицияПоступления") Тогда	
			ИмяФормыОбъекта = "Документ.бит_кзн_ПозицияПоступления.ФормаОбъекта";
		ИначеЕсли ТипЗнч(ТекущиеДанные.ДокументПланирования) = Тип("ДокументСсылка.бит_пз_ЗаявкаНаЗатраты") Тогда
			ИмяФормыОбъекта = "Документ.бит_пз_ЗаявкаНаЗатраты.ФормаОбъекта";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяФормыОбъекта) Тогда
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Позиция);			
			ОткрытьФорму(ИмяФормыОбъекта, ПараметрыФормы, ЭтотОбъект, ТекущиеДанные.Позиция);
		КонецЕсли;
					
	Иначе
		бит_РаботаСДиалогамиКлиент.ОбработкаВыбораПоляТабличногоПоля("ПереченьДокументов", 
			Объект.ПереченьДокументов, Поле, ВыбраннаяСтрока);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПереченьДокументовПричинаЗакрытияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПереченьДокументов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    ПричинаУказаннаПравильно(ТекущиеДанные);
	
КонецПроцедуры
	
#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипыДокументов
	
&НаКлиенте
Процедура ТипыДокументовПриИзменении(Элемент)
	
	ИзмененыВыбранныеТипы = Истина;
		
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыТипыДокументов

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ПериодЗаполненПравильно() Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ТипыДокументовЗаполненыПравильно() Тогда
		Возврат;
	КонецЕсли;
	
	СкрытьНастройки();
		
	ДобавленныеДокументы.Очистить();
	УстановитьОтборСформированныхДокументов(СформированныеДокументы, ДобавленныеДокументы);

	НачатьЗаполнениеСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	СкрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Объект.Период;
	
	Оповещение = Новый ОписаниеОповещения("НастроитьПериодЗавершение", ЭтотОбъект);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

// Обработчик завершения редактирования периода.
//  См. Синтакс-помощник: Показать().
// 
&НаКлиенте 
Процедура НастроитьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Объект.Период = РезультатВыбора;
		Если РезультатВыбора.Вариант <> ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
			НастройкаПериода = РезультатВыбора;		
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Если НЕ ПериодЗаполненПравильно() ИЛИ НЕ ТипыДокументовЗаполненыПравильно() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СохраняемыеНастройки());
	
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		УстановитьЗаголовок(Результат, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры // СохранитьНастройки()

&НаКлиенте
Процедура ВосстановитьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	Оповещение	   = Новый ОписаниеОповещения("ВосстановитьНастройкиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте 
Процедура ВосстановитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда        
		ПрименитьНастройки(Результат);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеДокументы(Команда)
	
	ОбработатьФлагиПереченьДокументов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеДокументы(Команда)
	
	ОбработатьФлагиПереченьДокументов(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьДокументы(Команда)
	
	Если Объект.ПереченьДокументов.Количество() = 0 Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , 
							"Заполнение",,,НСтр("ru = 'Закрываемые документы'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ПереченьДокументов", "Объект");
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Закрыть", Истина);
	
	ВыбранныеСтроки = Объект.ПереченьДокументов.НайтиСтроки(СтруктураОтбора);
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Не выбраны документы для закрытия.';
							  |en='No documents have been selected for closure.'");
		ПоказатьПредупреждение(, ТекстСообщения, 30);
		Возврат;
	КонецЕсли;
	
	Если РежимПодбора Тогда
		АдресРезультата = АдресРезультатаВХранилище();
		ОповеститьОВыборе(АдресРезультата);
	Иначе	
		НачатьЗакрытие();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФоновоеЗакрытие
	
&НаКлиенте
Процедура НачатьЗакрытие()

	ДлительнаяОперация = ЗапуститьФоновоеЗакрытие();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения 	   = НСтр("ru = 'Идет обработка списка документов'"); 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеЗакрытияДокументов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ПослеЗакрытияДокументовНаСервере();
		НачатьЗаполнениеСпискаДокументов();
		Элементы.СтраницыСДокументами.ТекущаяСтраница = Элементы.СтраницаСформированныеДокументы;
	Иначе
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗакрытие()
	
	АдресРезультата	   = ПоместитьВоВременноеХранилище(Новый Массив, УникальныйИдентификатор);
	ПереченьДокументов = Объект.ПереченьДокументов.Выгрузить();

	ПараметрыЗакрытьДокументы = Обработки.бит_ЗакрытиеДокументовПланирования.НовыеПараметрыЗакрытьДокументы();
	ЗаполнитьЗначенияСвойств(ПараметрыЗакрытьДокументы, Объект);
	
	ПараметрыЗакрытьДокументы.АдресРезультата = АдресРезультата;

	// Заполнение пераметов длительной операции.
	НаименованиеЗадания = НСтр("ru = 'Заполнение документа ""Закрытие документов планирования"".'");
	ВыполняемыйМетод	= "Обработки.бит_ЗакрытиеДокументовПланирования.ЗакрытьДокументы";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ВыполняемыйМетод, ПереченьДокументов, ПараметрыЗакрытьДокументы);
	Возврат ФоновоеЗадание;

КонецФункции

&НаСервере
Процедура ПослеЗакрытияДокументовНаСервере()

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Для каждого Элемент Из Результат Цикл
		ДобавленныеДокументы.Добавить(Элемент);
	КонецЦикла; 
	УстановитьОтборСформированныхДокументов(СформированныеДокументы, ДобавленныеДокументы);

КонецПроцедуры

#КонецОбласти

#Область ФоновоеЗаполнение

&НаКлиенте
Процедура НачатьЗаполнениеСпискаДокументов()

	Если НЕ ТипыДокументовЗаполненыПравильно() Тогда
		Возврат;
	КонецЕсли;

	ДлительнаяОперация = ЗапуститьФоновоеЗаполнениеСпискаДокументов();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения 	   = НСтр("ru = 'Идет заполнение списка документов'"); 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаполненияСпискаДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеЗаполненияСпискаДокументов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыСДокументами.ТекущаяСтраница = Элементы.СтраницаЗакрываемыеДокументы;
	
	Если Результат.Статус <> "Выполнено" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе
		ПослеЗаполненияСпискаДокументовНаСервере(Результат.АдресРезультата)	
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗаполнениеСпискаДокументов()
		
	// Заполнение пераметов длительной операции.
	НаименованиеЗадания = НСтр("ru = 'Заполнение списка документов для закрытия.'");
	ВыполняемыйМетод	= "Обработки.бит_ЗакрытиеДокументовПланирования.ЗаполнитьПереченьДокументов";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	ПользовательскиеНастройки  = Объект.КомпоновщикНастроек.ПользовательскиеНастройки;
	АдресСхемыКомпоновкиДанных = ИнициализироватьКомпоновщик(Объект.КомпоновщикНастроек, ПользовательскиеНастройки);
	СКД 					   = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	НастройкиКомпоновкиДанных  = Объект.КомпоновщикНастроек.ПолучитьНастройки();

	КонецПериодаОстатки = Новый Граница(КонецДня(Объект.Период.ДатаОкончания), ВидГраницы.Включая);
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "НачалоПериода", Объект.Период.ДатаНачала);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "КонецПериода", 		Объект.Период.ДатаОкончания);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "КонецПериодаОстатки", КонецПериодаОстатки);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "ПричинаЗакрытия", 	Объект.ПричинаЗакрытия);
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
						СКД, НастройкиКомпоновкиДанных);
	Возврат ФоновоеЗадание;

КонецФункции

&НаСервере
Процедура ПослеЗаполненияСпискаДокументовНаСервере(АдресРезультата)

	РезультатПоиска    = Объект.ПереченьДокументов.НайтиСтроки(Новый Структура("Закрыть", Истина));
	ВыбранныеДокументы = Новый Массив;
	Для каждого Элемент Из РезультатПоиска Цикл
		ВыбранныеДокументы.Добавить(Элемент.ДокументПланирования);
	КонецЦикла;
	
	ТаблицаДокументов  = ПолучитьИзВременногоХранилища(АдресРезультата);
	Объект.ПереченьДокументов.Загрузить(ТаблицаДокументов);

	Если ЗначениеЗаполнено(ВыбранныеДокументы) Тогда
		Для каждого СтрокаТаблицы  Из Объект.ПереченьДокументов Цикл
			СтрокаТаблицы.Закрыть = ВыбранныеДокументы.Найти(СтрокаТаблицы.ДокументПланирования) <> Неопределено;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция АдресРезультатаВХранилище()

	Результат = Новый Структура("ПереченьДокументов, ПричинаЗакрытия");

	Результат.ПереченьДокументов =  Объект.ПереченьДокументов.Выгрузить();
	Результат.ПричинаЗакрытия 	 = Объект.ПричинаЗакрытия;
	
	Возврат ПоместитьВоВременноеХранилище(Результат, Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Функция ПериодЗаполненПравильно()

	ЗаполненПравильно = Истина;
	
	Отказ  = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Период.ДатаНачала) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Начало периода';en = 'Period start'")); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Период.ДатаНачала", "Объект", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Период.ДатаОкончания) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Конец периода';en = 'Period end'")); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Период.ДатаОкончания", "Объект", Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Период.ДатаНачала) И ЗначениеЗаполнено(Объект.Период.ДатаОкончания) Тогда
		Если Объект.Период.ДатаОкончания < Объект.Период.ДатаНачала Тогда
			ТекстСообщения = НСтр("ru='Период указан неверно. Дата начала больше даты окончания.';
								  |en='The period is incorrect. The start date is greater than the end date.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Период.ДатаНачала", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли; 
	
	Если Отказ Тогда
		ЗаполненПравильно = Ложь;
	КонецЕсли;  
	
	Возврат ЗаполненПравильно; 

КонецФункции

&НаКлиенте
Функция ТипыДокументовЗаполненыПравильно()

	ПометкаУстановлена = Ложь;
	
	Для каждого Элемент Из ТипыДокументов Цикл
		Если Элемент.Пометка Тогда
			ПометкаУстановлена = Истина;	
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если НЕ ПометкаУстановлена Тогда
		ОткрытьНастройки();
		
		ТекстПояснения = НСтр("ru = 'Выберите типы документов.'; en = 'Select the document types.'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , "КОРРЕКТНОСТЬ",,,
							НСтр("ru = 'Типы документов'; en = 'Types of documents'"), ТекстПояснения);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ТипыДокументов");
	КонецЕсли;
	
	Возврат ПометкаУстановлена;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьФлагиПереченьДокументов(Пометка)
	
	Для Каждого ТекущаяСтрока Из Объект.ПереченьДокументов Цикл
		ТекущаяСтрока.Закрыть = Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаУказаннаПравильно(Контейнер)
	
	Регламент = ПредопределенноеЗначение("Справочник.бит_ПричиныЗакрытияДокументовПланированияПлатежа.Регламент");
	Если Контейнер.ПричинаЗакрытия = Регламент Тогда
        Контейнер.ПричинаЗакрытия = Неопределено;		
		ТекстСообщения = НСтр("ru='Причина закрытия ""%1"" устанавливается только регламентной операцией.';
							  |en='Reason for closing ""%1"" is set only routine operations.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Регламент);
		ПоказатьПредупреждение(, ТекстСообщения,, НСтр("ru='Закрытие документов';en='Closing documents'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСформированныхДокументов(Список, ЗначениеОтбора)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			"Ссылка",ЗначениеОтбора, ВидСравненияКомпоновкиДанных.ВСписке,,,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
КонецПроцедуры 

&НаКлиенте
Функция ПараметрыХраненияНастроек()

	ПараметрыХранения = Новый Структура;
	ПараметрыХранения.Вставить("ТипНастройки",		  ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыХранения.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект());

	Возврат ПараметрыХранения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НастраиваемыйОбъект()

	Возврат "Обработка.бит_ЗакрытиеДокументовПланирования";

КонецФункции

&НаСервере
Функция ИнициализироватьКомпоновщик(КомпоновщикНастроек, ПользовательскиеНастройки)

	ВыбранныеТипы = Обработки.бит_ЗакрытиеДокументовПланирования.ВыбранныеТипы(ТипыДокументов);
	
	АдресСКД = Обработки.бит_ЗакрытиеДокументовПланирования.ИнициализироватьКомпоновщик(КомпоновщикНастроек, 
						ВыбранныеТипы, ПользовательскиеНастройки);
	
	Возврат АдресСКД;
	     
КонецФункции

&НаСервере
Функция СохраняемыеНастройки()
	
	СохраняемыеНастройки = Обработки.бит_ЗакрытиеДокументовПланирования.НовыеСохраняемыеНастройки();

	ЗаполнитьЗначенияСвойств(СохраняемыеНастройки, Объект);
	СохраняемыеНастройки.ВариантПериода 		   = НастройкаПериода.Вариант;
	СохраняемыеНастройки.ВыбранныеТипы			   = Обработки.бит_ЗакрытиеДокументовПланирования.ВыбранныеТипы(ТипыДокументов);
	СохраняемыеНастройки.ПользовательскиеНастройки = Объект.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	Возврат СохраняемыеНастройки;
	
КонецФункции

&НаСервере
Процедура ПрименитьНастройки(НастройкаПодбораДокументов)

	Обработки.бит_ЗакрытиеДокументовПланирования.ПрименитьНастройки(НастройкаПодбораДокументов, ТипыДокументов, Объект);
	УстановитьЗаголовок(НастройкаПодбораДокументов, ЭтотОбъект);
	
	НастройкаПериода = Объект.Период;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовок(Настройка, Форма)

	Заголовок = НСтр("ru = 'Закрытие документов планирования %1'; en = 'Planning Documents Closure %1'");
	Если ЗначениеЗаполнено(Настройка) Тогда
		Заголовок = СтрШаблон(Заголовок, "(" + Строка(Настройка) + ")");
	Иначе	
		Заголовок = СтрШаблон(Заголовок, "");
	КонецЕсли;

	Форма.Заголовок = Заголовок;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	Перем НастройкаПоУмолчанию;
	
	РежимПодбора = Параметры.РежимПодбора;
	
	Если НЕ РежимПодбора Тогда
		НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект());
	КонецЕсли;

	Обработки.бит_ЗакрытиеДокументовПланирования.ЗаполнитьТипыДокументов(ТипыДокументов);
	ПрименитьНастройки(НастройкаПоУмолчанию);

	Если РежимПодбора Тогда
		Дополнительно = Новый Структура("ВПользовательскиеНастройки, ЗаменятьСуществующий", Истина, Истина);
		бит_ОтчетыБФКлиентСервер.ДобавитьОтбор(Объект.КомпоновщикНастроек, "Организация", Параметры.Организация,,, Дополнительно);
	КонецЕсли;

	// Настроим отображение полей доп. аналитик в таблицах формы.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,
		"ПереченьДокументов",Неопределено,Неопределено);

	УстановитьОтборСформированныхДокументов(СформированныеДокументы, ДобавленныеДокументы);

КонецПроцедуры // УстановитьЗначенияПоУмолчанию()

&НаКлиенте
Процедура ОткрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница	  = Элементы.НастройкиОбработки;
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;	

КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()

	Если ТипыДокументовЗаполненыПравильно() Тогда
		Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.Обработка;
		Элементы.Сформировать.КнопкаПоУмолчанию	  = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеВыбранныхТипов()
	
	ПользовательскиеНастройки = Объект.КомпоновщикНастроек.ПользовательскиеНастройки;	
	ИнициализироватьКомпоновщик(Объект.КомпоновщикНастроек, ПользовательскиеНастройки);
	
	ИзмененыВыбранныеТипы = Ложь;
	
КонецПроцедуры

#КонецОбласти
